# PaperFormat Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..PaperFormat Property
PDFExportOptions Class See Also
---
Paper format.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ExportPaperFormat PaperFormat { get; set; }
```

Visual Basic
---
```text
Public Property PaperFormat As ExportPaperFormat
	Get
	Set
```

Visual C++
---
```text
public:
property ExportPaperFormat PaperFormat {
	ExportPaperFormat get ();
	void set (ExportPaperFormat value);
}
```

# Remarks
When the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The input paper format is invalid |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace